using System;

namespace Example003_Sum
{
    class Program
    {
        static void Main(string[] args)
        {
            /* Написать программу, в которую пользователь вводит два целых числа 
            и которая выводит сумму этих чисел*/
                
            int numberA = 31;
            int numberB = 5;
            int result = numberA + numberB;
            Console.WriteLine(result);
        }
    }
}
